[
  {
    "protocolName": "HTTP",
    "correctLayerNumber": 7,
    "explanation": "HyperText Transfer Protocol wird für das Surfen im Web verwendet und ermöglicht die Kommunikation zwischen Webbrowsern und Webservern."
  },
  {
    "protocolName": "HTTPS",
    "correctLayerNumber": 7,
    "explanation": "HyperText Transfer Protocol Secure ist die sichere Version von HTTP und verschlüsselt Daten für eine sichere Webkommunikation."
  },
  {
    "protocolName": "FTP",
    "correctLayerNumber": 7,
    "explanation": "File Transfer Protocol wird für die Übertragung von Dateien zwischen einem Client und einem Server in einem Computernetzwerk verwendet."
  },
  {
    "protocolName": "SMTP",
    "correctLayerNumber": 7,
    "explanation": "Simple Mail Transfer Protocol wird für das Senden von E-Mail-Nachrichten zwischen Servern verwendet."
  },
  {
    "protocolName": "DNS",
    "correctLayerNumber": 7,
    "explanation": "Domain Name System übersetzt für Menschen lesbare Domainnamen (z.B. www.example.com) in maschinenlesbare IP-Adressen."
  },
  {
    "protocolName": "Telnet",
    "correctLayerNumber": 7,
    "explanation": "Telnet bietet eine bidirektionale, interaktive, textorientierte Kommunikationsmöglichkeit über eine virtuelle Terminalverbindung. (Größtenteils aus Sicherheitsgründen durch SSH ersetzt)."
  },
  {
    "protocolName": "SSL/TLS",
    "correctLayerNumber": 6,
    "explanation": "Secure Sockets Layer (SSL) und Transport Layer Security (TLS) sind kryptographische Protokolle zur Gewährleistung der Kommunikationssicherheit über ein Computernetzwerk. Sie arbeiten auf der Darstellungsschicht, um Daten von der Anwendungsschicht zu verschlüsseln."
  },
  {
    "protocolName": "JPEG",
    "correctLayerNumber": 6,
    "explanation": "JPEG ist ein gängiges Bildformat, das angibt, wie ein Bild komprimiert und gespeichert wird. Die Darstellungsschicht behandelt solche Datenformatierungen."
  },
  {
    "protocolName": "MPEG",
    "correctLayerNumber": 6,
    "explanation": "MPEG ist ein Standard für Video- und Audiokompression. Die Darstellungsschicht ist für die Kodierung und Dekodierung von Multimediadaten zuständig."
  },
  {
    "protocolName": "NetBIOS",
    "correctLayerNumber": 5,
    "explanation": "Network Basic Input/Output System ermöglicht Anwendungen auf getrennten Computern die Kommunikation über ein lokales Netzwerk und verwaltet die Sitzungen zwischen ihnen."
  },
  {
    "protocolName": "RPC (Remote Procedure Call)",
    "correctLayerNumber": 5,
    "explanation": "Remote Procedure Call ermöglicht es einem Programm auf einem Computer, eine Prozedur (Subroutine) im Adressraum eines anderen Computers auszuführen und verwaltet die Sitzung für diese Interaktion."
  },
  {
    "protocolName": "TCP",
    "correctLayerNumber": 4,
    "explanation": "Transmission Control Protocol bietet eine zuverlässige, geordnete und fehlergeprüfte Übertragung eines Oktettstroms zwischen Anwendungen, die auf Hosts laufen, die über ein IP-Netzwerk kommunizieren."
  },
  {
    "protocolName": "UDP",
    "correctLayerNumber": 4,
    "explanation": "User Datagram Protocol ist ein verbindungsloses Protokoll, das minimalen Overhead bietet. Es wird für Anwendungen verwendet, bei denen Geschwindigkeit Vorrang vor Zuverlässigkeit hat, wie z.B. Videostreaming oder Online-Spiele."
  },
  {
    "protocolName": "IP",
    "correctLayerNumber": 3,
    "explanation": "Internet Protocol ist das Hauptkommunikationsprotokoll für die Weiterleitung von Datagrammen über Netzwerkgrenzen hinweg. Es stellt logische Adressierung (IP-Adressen) und Routing bereit."
  },
  {
    "protocolName": "ICMP",
    "correctLayerNumber": 3,
    "explanation": "Internet Control Message Protocol wird von Netzwerkgeräten wie Routern verwendet, um Fehlermeldungen und Betriebsinformationen zu senden, die z.B. anzeigen, dass ein angeforderter Dienst nicht verfügbar ist oder ein Host/Router nicht erreicht werden konnte."
  },
  {
    "protocolName": "ARP",
    "correctLayerNumber": 2,
    "explanation": "Address Resolution Protocol löst IP-Adressen (Vermittlungsschicht) in MAC-Adressen (Sicherungsschicht) für die Kommunikation innerhalb eines lokalen Netzwerksegments auf."
  },
  {
    "protocolName": "PPP",
    "correctLayerNumber": 2,
    "explanation": "Point-to-Point Protocol ist ein Kommunikationsprotokoll der Sicherungsschicht, das verwendet wird, um eine direkte Verbindung zwischen zwei Knoten herzustellen. Es wird häufig für Einwahl- und DSL-Verbindungen verwendet."
  },
  {
    "protocolName": "Ethernet",
    "correctLayerNumber": 2,
    "explanation": "Ethernet ist eine Familie von Technologien für kabelgebundene Computernetzwerke, die häufig in lokalen Netzwerken (LANs) verwendet werden. Es definiert, wie Datenpakete gerahmt und übertragen werden."
  },
  {
    "protocolName": "WLAN (802.11)",
    "correctLayerNumber": 2,
    "explanation": "WLAN (Wi-Fi) ist eine Familie von drahtlosen Netzwerkprotokollen, die auf der IEEE 802.11-Standardfamilie basieren. Es arbeitet auf der Sicherungsschicht (MAC-Unterschicht) und der Bitübertragungsschicht."
  },
  {
    "protocolName": "Bluetooth",
    "correctLayerNumber": 1,
    "explanation": "Bluetooth ist ein Standard für drahtlose Technologie mit kurzer Reichweite, der für den Datenaustausch zwischen festen und mobilen Geräten über kurze Distanzen verwendet wird. Er definiert Spezifikationen der Bitübertragungsschicht wie Funkfrequenzen."
  },
  {
    "protocolName": "USB",
    "correctLayerNumber": 1,
    "explanation": "Universal Serial Bus ist ein Industriestandard, der Spezifikationen für Kabel, Anschlüsse und Protokolle für Verbindung, Kommunikation und Stromversorgung zwischen PCs und Peripheriegeräten festlegt. Er arbeitet primär auf der Bitübertragungsschicht."
  },
  {
    "protocolName": "DSL",
    "correctLayerNumber": 1,
    "explanation": "Digital Subscriber Line ist eine Familie von Technologien, die zur Übertragung digitaler Daten über Telefonleitungen verwendet werden. Sie arbeitet auf der Bitübertragungsschicht."
  },
  {
    "protocolName": "CSMA/CD",
    "correctLayerNumber": 2,
    "explanation": "Carrier Sense Multiple Access with Collision Detection ist ein Medienzugriffsverfahren, das vor allem in der frühen Ethernet-Technologie für lokale Netzwerke verwendet wurde. Es ist ein Protokoll der Sicherungsschicht."
  }
]