[
  {
    "id": "phys",
    "number": 1,
    "name": "Bitübertragungsschicht (Physical Layer)",
    "description": "Definiert die elektrischen, mechanischen und funktionalen Schnittstellen zum Übertragungsmedium. Überträgt Bits als rohen Datenstrom. Zuständig für Spannungspegel, Timing, Datenraten und physische Verbinder.",
    "color": "#FFADAD"
  },
  {
    "id": "link",
    "number": 2,
    "name": "Sicherungsschicht (Data Link Layer)",
    "description": "Stellt eine zuverlässige Übertragung über ein physisches Medium sicher. Formatiert Daten in Frames, handhabt physische Adressierung (MAC-Adressen), Fehlererkennung und -korrektur sowie Flusskontrolle.",
    "color": "#FFD6A5"
  },
  {
    "id": "netw",
    "number": 3,
    "name": "Vermittlungsschicht (Network Layer)",
    "description": "Verantwortlich für das Routing von Datenpaketen durch das Netzwerk von der Quelle zum Ziel. Behandelt logische Adressierung (IP-Adressen), Wegewahl und die Fragmentierung von Paketen.",
    "color": "#FDFFB6"
  },
  {
    "id": "tran",
    "number": 4,
    "name": "Transportschicht (Transport Layer)",
    "description": "Stellt eine Ende-zu-Ende-Kommunikation zwischen Anwendungen sicher. Bietet wahlweise verbindungsorientierte (TCP) oder verbindungslose (UDP) Dienste, Segmentierung, Fehlerkontrolle und Flusskontrolle.",
    "color": "#CAFFBF"
  },
  {
    "id": "sess",
    "number": 5,
    "name": "Sitzungsschicht (Session Layer)",
    "description": "Erstellt, verwaltet und beendet Sitzungen (Verbindungen) zwischen Anwendungen. Synchronisiert den Datenaustausch und stellt Wiederherstellungspunkte (Checkpoints) bereit.",
    "color": "#9BF6FF"
  },
  {
    "id": "pres",
    "number": 6,
    "name": "Darstellungsschicht (Presentation Layer)",
    "description": "Übersetzt Daten zwischen dem Anwendungsformat und einem netzwerkgeeigneten Format. Verantwortlich für Datenkompression, Verschlüsselung und die Konvertierung von Zeichensätzen.",
    "color": "#BDB2FF"
  },
  {
    "id": "app",
    "number": 7,
    "name": "Anwendungsschicht (Application Layer)",
    "description": "Stellt Netzwerkdienste direkt für Benutzeranwendungen bereit. Enthält Protokolle, die Anwendungen zum Datenaustausch verwenden, z.B. HTTP für Web-Browsing, FTP für Dateiübertragung und SMTP für E-Mail.",
    "color": "#A0C4FF"
  }
]