[
  {
    "protocolName": "HTTP",
    "correctLayerNumber": 7,
    "explanation": "HyperText Transfer Protocol is used for web browsing, enabling communication between web browsers and web servers."
  },
  {
    "protocolName": "HTTPS",
    "correctLayerNumber": 7,
    "explanation": "HyperText Transfer Protocol Secure is the secure version of HTTP, encrypting data for secure web communication."
  },
  {
    "protocolName": "FTP",
    "correctLayerNumber": 7,
    "explanation": "File Transfer Protocol is used for transferring files between a client and a server on a computer network."
  },
  {
    "protocolName": "SMTP",
    "correctLayerNumber": 7,
    "explanation": "Simple Mail Transfer Protocol is used for sending email messages between servers."
  },
  {
    "protocolName": "DNS",
    "correctLayerNumber": 7,
    "explanation": "Domain Name System translates human-readable domain names (e.g., www.example.com) into machine-readable IP addresses."
  },
  {
    "protocolName": "Telnet",
    "correctLayerNumber": 7,
    "explanation": "Telnet provides bidirectional interactive text-oriented communication facility using a virtual terminal connection. (Largely superseded by SSH for security)."
  },
  {
    "protocolName": "SSL/TLS",
    "correctLayerNumber": 6,
    "explanation": "Secure Sockets Layer (SSL) and Transport Layer Security (TLS) are cryptographic protocols designed to provide communications security over a computer network. They operate at the Presentation layer to encrypt data from the Application layer."
  },
  {
    "protocolName": "JPEG",
    "correctLayerNumber": 6,
    "explanation": "JPEG is a common image format that specifies how an image is compressed and stored. The Presentation layer handles such data formatting."
  },
  {
    "protocolName": "MPEG",
    "correctLayerNumber": 6,
    "explanation": "MPEG is a standard for video and audio compression. The Presentation layer is responsible for encoding and decoding multimedia data."
  },
  {
    "protocolName": "NetBIOS",
    "correctLayerNumber": 5,
    "explanation": "Network Basic Input/Output System allows applications on separate computers to communicate over a local area network, managing sessions between them."
  },
  {
    "protocolName": "RPC",
    "correctLayerNumber": 5,
    "explanation": "Remote Procedure Call allows a program on one computer to cause a procedure (subroutine) to execute in another computer's address space, managing the session for this interaction."
  },
  {
    "protocolName": "TCP",
    "correctLayerNumber": 4,
    "explanation": "Transmission Control Protocol provides reliable, ordered, and error-checked delivery of a stream of octets between applications running on hosts communicating via an IP network."
  },
  {
    "protocolName": "UDP",
    "correctLayerNumber": 4,
    "explanation": "User Datagram Protocol is a connectionless protocol that offers minimal overhead. It's used for applications where speed is prioritized over reliability, like video streaming or online gaming."
  },
  {
    "protocolName": "IP",
    "correctLayerNumber": 3,
    "explanation": "Internet Protocol is the principal communications protocol for relaying datagrams across network boundaries. It provides logical addressing (IP addresses) and routing."
  },
  {
    "protocolName": "ICMP",
    "correctLayerNumber": 3,
    "explanation": "Internet Control Message Protocol is used by network devices, like routers, to send error messages and operational information indicating, for example, that a requested service is not available or that a host or router could not be reached."
  },
  {
    "protocolName": "ARP",
    "correctLayerNumber": 2,
    "explanation": "Address Resolution Protocol resolves IP addresses (Network Layer) to MAC addresses (Data Link Layer) for communication within a local network segment."
  },
  {
    "protocolName": "PPP",
    "correctLayerNumber": 2,
    "explanation": "Point-to-Point Protocol is a data link layer communication protocol used to establish a direct connection between two nodes. It's commonly used for dial-up and DSL connections."
  },
  {
    "protocolName": "Ethernet",
    "correctLayerNumber": 2,
    "explanation": "Ethernet is a family of wired computer networking technologies commonly used in local area networks (LAN). It defines how data packets are framed and transmitted."
  },
  {
    "protocolName": "Wi-Fi (802.11)",
    "correctLayerNumber": 2,
    "explanation": "Wi-Fi is a family of wireless network protocols, based on the IEEE 802.11 family of standards. It operates at the Data Link Layer (MAC sublayer) and Physical Layer."
  },
  {
    "protocolName": "Bluetooth",
    "correctLayerNumber": 1,
    "explanation": "Bluetooth is a short-range wireless technology standard used for exchanging data between fixed and mobile devices over short distances. It defines physical layer specifications like radio frequencies."
  },
  {
    "protocolName": "USB",
    "correctLayerNumber": 1,
    "explanation": "Universal Serial Bus is an industry standard that establishes specifications for cables, connectors and protocols for connection, communication and power supply between personal computers and their peripheral devices. It primarily operates at the Physical Layer."
  },
  {
    "protocolName": "DSL",
    "correctLayerNumber": 1,
    "explanation": "Digital Subscriber Line is a family of technologies that are used to transmit digital data over telephone lines. It operates at the Physical Layer."
  },
  {
    "protocolName": "CSMA/CD",
    "correctLayerNumber": 2,
    "explanation": "Carrier Sense Multiple Access with Collision Detection is a media access control method used most notably in early Ethernet technology for local area networking. It's a Data Link Layer protocol."
  }
]